app/Http/Controllers/Auth/AuthController.php

    public function register(Request $request)
    {
        try {
            $request->validate([
                'name' => 'required|string|max:255',
                'username' => 'required|string|max:255|unique:users',
                'email' => 'required|email|string|max:255|unique:users',
                'phone' => 'required|string|max:14',
                'password' => ['required', 'string'],
            ]);


            User::create([
                'name' => $request->name,
                'username' => $request->username,
                'email' => $request->email,
                'phone' => $request->phone,
                'password' => Hash::make($request->password),
            ]);

            $user = User::where('email', $request->email)->first();
---
insert into `users` (`name`, `username`, `email`, `phone`, `password`, `updated_at`, `created_at`) values ('Rania Sucipto', 'raniacantik', 'rania@atresna.com', '085773548687', '$2y$10$iaWp/IxX3VFgYK6rf43UkO..u9cAbRE5OYvXEWzaNYhIppodhxNnW', '2024-01-06 11:52:00', '2024-01-06 11:52:00')
select * from `users` where `email` = 'rania@atresna.com' limit 1

    public function login_api(Request $request)
    {
        try {
            $request->validate([
                'email' => 'email|required',
                'password' => 'required'
            ]);

            $credential = request(['email', 'password']);
            if (!Auth::attempt($credential)) {
                return ResponseFormater::error(
                    ['message' => 'UnAuthorized'],
                    'Authentication Failed',
                    500
                );
            }

            $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'rania@atresna.com' limit 1

    public function updateUser(Request $request)
    {
        $data = $request->all();

        $user = Auth::user();
        $user->update($data);
---
update `users` set `username` = 'raniacantik123', `password` = 'killingme12', `users`.`updated_at` = '2023-11-14 14:10:21' where `id` = 2

    public function api_logout(Request $request)
    {
        $token = $request->user()->currentAccessToken()->delete();
---
delete from `personal_access_tokens` where `id` = 4