app/Http/Controllers/API/CategoriesController.php

    public function all(Request $request)
    {
        $id = $request->input('id');
        $limit = $request->input('limit');
        $name = $request->input('name');
        $show_product = $request->input('show_product');

        // Jika id ada isinya maka akan mnegembalikan Product Per Kategori
        if ($id) {
            $categories = ProductCategories::with(['products'])->find($id);
---
select * from `product_categories` where `product_categories`.`id` = '1' and `product_categories`.`deleted_at` is null limit 1
select * from `products` where `products`.`categories_id` in (1) and `products`.`deleted_at` is null