app/Http/Controllers/API/ProductController.php

    public function all(Request $request)
    {
        $id = $request->input('id');
        $limit = $request->input('limit');
        $name = $request->input('name');
        $description = $request->input('description');
        $tags = $request->input('tags');
        $categories = $request->input('categories');
        $price_from = $request->input('price_from');
        $price_to = $request->input('price_to');

        // Jika id ada isinya maka akan mnegembalikan Product Per Kategori
        if ($id) {
            $product = Product::with(['galleries', 'category'])->find($id);
---
select * from `products` where `products`.`id` = '1' and `products`.`deleted_at` is null limit 1