app/Http/Controllers/API/TransactionController.php

    public function fetchAll(Request $request)
    {
        $id = $request->input('id');
        $limit = $request->input('limit', 6);
        $status = $request->input('status');

        if ($id) {
            $transaction = Transaction::with(['items.product'])->find($id);
            if ($transaction) {
                return ResponseFormater::success($transaction, 'Data Berhasil Di Ambil');
            } else {
                return ResponseFormater::error(NULL, 'Data tidak ditemeukan', 404);
            }
        }

        $transaction = Transaction::with(['items.product'])->where('users_id', Auth::user()->id);


        if ($status) {
            $transaction->where('status', $status);
        }

        return ResponseFormater::success($transaction->paginate($limit), 'Data Berhasil Diambil');
---
select count(*) as aggregate from `transactions` where `users_id` = 1 and `transactions`.`deleted_at` is null