app/Http/Controllers/Data/KonfigurasiDataController.php

    public function updateCompanyInfo(Request $request)
    {
        $data = $request->all();
        $companyInfo = CompanyInfo::find(1);
---
select * from `company_info` where `company_info`.`id` = 1 limit 1