app/Http/Controllers/FrontPages/FrontPagesControlller.php

select `company_name`, `company_slogan`, `company_logo`, `company_address`, `company_email`, `company_phone` from `company_info` where `id` = 1
select * from `sliders` where `sliders`.`id` = 1 limit 1
---
    public function index()
    {
        $companyInfo = CompanyInfo::where('id', 1)->get(['company_name', 'company_slogan', 'company_logo', 'company_address', 'company_email', 'company_phone',]);
        $sliders = Slider::find(1);

select `company_name`, `company_slogan`, `company_logo`, `company_address`, `company_email`, `company_phone` from `company_info` where `id` = 1
select * from `sliders`
---
    public function produkPages()
    {
        $companyInfo = CompanyInfo::where('id', 1)->get(['company_name', 'company_slogan', 'company_logo', 'company_address', 'company_email', 'company_phone']);
        $sliders = Slider::get();